IDEA Open Model
Segment3D.StartPoint Property
Compatible with IDEA StatiCa 20.1
 Gets or sets the reference to Point3D startpoint of the segment.
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public ReferenceElement StartPoint { get; set; }
Public Property StartPoint As ReferenceElement
	Get
	Set
Property Value
Type: ReferenceElement
See Also
Reference
Segment3D Class
IdeaRS.OpenModel.Geometry3D Namespace